snlkuharlocal/src/InformationRegisters/СтатусыКМ_Факт/СтатусыКМ_Факт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыКМ_Факт</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКодовМаркировкиФакт</types>
    </type>
  </resources>
  <resources>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ВПути</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/ТипыШтрихКодов/ТипыШтрихКодов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыШтрихКодов</name>
  <enumValues>
    <name>Штука</name>
    <comment>Штрих код штуки</comment>
  </enumValues>
  <enumValues>
    <name>Блочок</name>
    <comment>Штрих код блочка</comment>
  </enumValues>
  <enumValues>
    <name>Коробка</name>
    <comment>Штрих код коробки</comment>
  </enumValues>
  <enumValues>
    <name>Палета</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СпособыВводаВОборотСУЗ/СпособыВводаВОборотСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыВводаВОборотСУЗ</name>
  <enumValues>
    <name>Производство</name>
  </enumValues>
  <enumValues>
    <name>Импорт</name>
  </enumValues>
  <enumValues>
    <name>МаркировкаОстатков</name>
  </enumValues>
  <enumValues>
    <name>ТрансграничнаяТорговля</name>
  </enumValues>
  <enumValues>
    <name>Перемаркировка</name>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
  </enumValues>
  <enumValues>
    <name>ПокупкаВРФ</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЗаказНаЭмиссиюКодовМаркировкиСУЗ/ЗаказНаЭмиссиюКодовМаркировкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказНаЭмиссиюКодовМаркировкиСУЗ</name>
  <comment>Заказ на эмиссию кодов маркировки СУЗ</comment>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_ЧЗ</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиДоступныхКМ</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.КонтрактСПроизводителем</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемаркировка</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_ДокументаЧЗ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолученоКодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолученоКодовИзЧЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатурыЧЗВДокументе</name>
    <type>
      <types>EnumRef.ВидыНоменклатурыЧЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеНанесения</name>
    <type>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВводаВОборот</name>
    <type>
      <types>EnumRef.СтатусыДокументовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаЗапланирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКомплекта</name>
    <type>
      <types>EnumRef.ВидыКомплектов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКомплект</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолученоКодовКомплект</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СозданАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ГТИН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКомплект</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.Комплектация</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Catalogs/ШтрихкодыУпаковокТоваров/ШтрихкодыУпаковокТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШтрихкодыУпаковокТоваров</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ДатаУпаковки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКМ</name>
    <type>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеШтрихкода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>220</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодировкаШтрихкода</name>
    <type>
      <types>EnumRef.ТипыКодировокШК</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <comment>Количество в базовых единицах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Машина</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКода</name>
    <type>
      <types>EnumRef.ТипыКодовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВложенныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВложенныеШтрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/InformationRegisters/СтатусыКМ_Факт/ManagerModule.bsl
Функция ЗаблокироватьТаблицу(Знач мНоменклатура = Неопределено, Знач ТипШК = Неопределено) Экспорт  
	Блокировка				= Новый БлокировкаДанных;					
					
	ЭлементБлокировки 		= Блокировка.Добавить("РегистрСведений.СтатусыКМ_Факт");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;					
	
	Если ЗначениеЗаполнено(мНоменклатура) Тогда
		тНоменклатура = Новый ТаблицаЗначений;
		тНоменклатура.Колонки.Добавить("Номенклатура",  Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		
		Если ТипЗнч(мНоменклатура) =  Тип("Массив") Тогда
			Для Каждого Номенклатура Из мНоменклатура Цикл
				СтрокаТЧ = тНоменклатура.Добавить();
				СтрокаТЧ.Номенклатура = Номенклатура;
			КонецЦикла;
		Иначе
			СтрокаТЧ = тНоменклатура.Добавить();
			СтрокаТЧ.Номенклатура = мНоменклатура;
		КонецЕсли;
		
		ЭлементБлокировки.ИсточникДанных = тНоменклатура; 
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипШК) Тогда
		ЭлементБлокировки.УстановитьЗначение("ТипШК", ТипШК); 		
	КонецЕсли;	
	
	Блокировка.Заблокировать();                         

КонецФункции //ЗаблокироватьТаблицу() Экспорт

Функция УстановитьСтатусКМ(МассивКМ, Статус, Регистратор, ДопПараметры = Неопределено) Экспорт
	Если НЕ ЗначениеЗаполнено(Регистратор) Тогда Возврат Ложь КонецЕсли; 
	
	Если ТипЗнч(МассивКМ) = Тип("Массив") Тогда
		Коды = МассивКМ;		
	Иначе
		Коды = Новый Массив;		
		Коды.Добавить(МассивКМ);
	КонецЕсли;
	
	Местонахождение = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Местонахождение", ОбщегоНазначения_ПИ.ПолучитьПодразделениеТекущегоУзла());
	ВПути 			= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ВПути", 	Ложь);
	Добавлять		= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Добавлять", Ложь);
	
	НЗ = РегистрыСведений.СтатусыКМ_Факт.СоздатьНаборЗаписей();
	НЗ.Отбор.Регистратор.Установить(Регистратор, Истина);
	
	Период = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Период");
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		Период = ПолучитьРеквизитШапки(Регистратор, "Дата");	
	КонецЕсли; 
	
	Для каждого ДанныеШК Из ПолучитьДанныеКМ(Коды) Цикл
		Запись = НЗ.Добавить();
		
		Запись.Период 			= Период;
		
		Запись.ШтрихКодУпаковки = ДанныеШК.ШтрихКодУпаковки;
		Запись.Номенклатура		= ДанныеШК.Номенклатура;
		Запись.ТипШК			= ДанныеШК.ТипШК;
		
		Запись.Статус 			= Статус;
		Запись.Местонахождение 	= Местонахождение;
		Запись.ВПути			= ВПути;		
	КонецЦикла; 
	
	НачатьТранзакцию();
	
	Попытка
		УстановитьБлокировкуПоНаборуЗаписей(НЗ);	
	Исключение       
		ОтменитьТранзакцию();
		ЗаписатьВЛог("Отладка", "Ошибка блокировки таблицы статусов. Регистратор: " + Регистратор, "Ошибка");
		Возврат Ложь;
	КонецПопытки;		
	
	Попытка
		Если Добавлять Тогда
			НЗ.Записать(Ложь);
		Иначе		
			НЗ.Записать(Истина);
		КонецЕсли;
	Исключение
		ОтменитьТранзакцию();
		ЗаписатьВЛог("Отладка", "Ошибка записи статусов. Регистратор: " + Регистратор, "Ошибка");
		Возврат Ложь;
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();		
	
	Возврат Истина;
КонецФункции //УстановитьСтатусКМ(МассивКМ, Регистратор, ДопПараметры = Неопределено)

Функция ПолучитьДанныеКМ(МассивКМ)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ	
	|	Ссылка		КАК ШтрихКодУпаковки,
	|	ТипШК		КАК ТипШК,
	|	ВЫБОР 
	|		КОГДА ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука) ТОГДА Владелец	
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК Номенклатура		
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	Ссылка В (&МассивКМ)
	|";         
	
	Запрос.УстановитьПараметр("МассивКМ", МассивКМ);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции //ПолучитьДанныеКМ(МассивКМ)

Функция ОчиститьДвижения(ДокСсылка) Экспорт
	НЗ = РегистрыСведений.СтатусыКМ_Факт.СоздатьНаборЗаписей();
	НЗ.Отбор.Регистратор.Установить(ДокСсылка, Истина);
	
	Если ЗначениеЗаполнено(НЗ.Отбор.Регистратор.Значение) Тогда
		НЗ.Записать();			
	КонецЕсли;
КонецФункции //ОчиститьДвижения(ДокСсылка) Экспорт

Функция УстановитьБлокировкуПоНаборуЗаписей(НаборЗаписей) Экспорт
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки 		= Блокировка.Добавить("РегистрСведений.СтатусыКМ_Факт");
	ЭлементБлокировки.Режим 			= РежимБлокировкиДанных.Исключительный;
	
	ЭлементБлокировки.ИсточникДанных 	= НаборЗаписей.Выгрузить();
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ШтрихКодУпаковки", "ШтрихКодУпаковки");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", 	"Номенклатура");
	
	Блокировка.Заблокировать();	
КонецФункции //УстановитьБлокировкуПоНЗ(НаборЗаписей) Экспорт

#Область ОбменДанными

Функция ПолучитьПравилоВыгрузки() Экспорт
	ПравилоВыгрузки = ОбменДаннымиЧЗ.ПолучитьПравилоВыгрузкиРегистра_ПоРегистратору("РегистрСведений.СтатусыКМ_Факт", "СтатусыКМ_Факт");
	ПравилоВыгрузки.Вставить("РазмерПорции", 50000);
	
	ПравилоВыгрузки.ТекстЗапросаИзменений = "		
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Изменения.Регистратор КАК Ссылка,
	|	СУММА(ВЫБОР КОГДА Записи.Регистратор ЕСТЬ NULL ТОГДА 0 ИНАЧЕ 1 КОНЕЦ) КАК КолЗаписей
	|ИЗ	
	|	РегистрСведений.СтатусыКМ_Факт.Изменения КАК Изменения
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СтатусыКМ_Факт	КАК Записи            
	|ПО
	|	Изменения.Регистратор = Записи.Регистратор
	|ГДЕ
	|	Узел = &УзелПолучатель И
	|	ВЫБОР            
	|		КОГДА ТипЗначения(&УзелПолучатель) = Тип(ПланОбмена.Свертка) ТОГДА Истина
	|		КОГДА Изменения.Регистратор ССЫЛКА Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ ТОГДА
	|			ВЫБОР 
	|				КОГДА ВЫРАЗИТЬ(Изменения.Регистратор КАК Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ).СпособВводаВОборот = ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.Импорт) ТОГДА
	|					ВЫБОР 
	|						КОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ТекущаяДата,День),НАЧАЛОПЕРИОДА(&ТекущаяДата,Час),Час) МЕЖДУ 5 И 8 ТОГДА Истина //Можно все
	|						ИНАЧЕ Ложь
	|					КОНЕЦ
	|				ИНАЧЕ Истина 
	|			КОНЕЦ
	|		ИНАЧЕ Истина
	|	КОНЕЦ
	|СГРУППИРОВАТЬ ПО
	|	Изменения.Регистратор
	|";	
	
	Возврат ПравилоВыгрузки;	
КонецФункции //ПолучитьПравилоВыгрузки() Экспорт

#КонецОбласти
